Masmiseim36/nxpSDK/boards/frdmimxrt1186/demo_apps/mc_pmsm/pmsm_enc/cm7/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1186xxxxx
package_id: MIMXRT1186XVJ8C
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: B4, pin_signal: GPIO_AON_15, label: ETH0, identifier: ETH0;ETH0_RESET}
- {pin_num: C8, pin_signal: GPIO_AON_20, label: ETH2, identifier: ETH2;ETH2_RESET}
- {pin_num: H4, pin_signal: GPIO_EMC_B1_01, label: ENC_B, identifier: pin;flexio_pin;ENC_B}
- {pin_num: L13, pin_signal: GPIO_AD_29, label: CUR_C, identifier: FLEXIO_SPI;CUR_C}
- {pin_num: A9, pin_signal: GPIO_AON_03, label: ETH0, identifier: ETH0_INT_B}
- {pin_num: B5, pin_signal: GPIO_AON_04, label: ETH2, identifier: ETH2_INT_B}
- {pin_num: N14, pin_signal: GPIO_AD_12, label: CUR_A, identifier: CUR_A}
- {pin_num: M13, pin_signal: GPIO_AD_13, label: CUR_B, identifier: CUR_B}
- {pin_num: M12, pin_signal: GPIO_AD_14, label: VOLT_DCB, identifier: VOLT_DCB}
- {pin_num: D7, pin_signal: GPIO_EMC_B1_12, label: PWM_AT, identifier: PWM_AT}
- {pin_num: E3, pin_signal: GPIO_EMC_B1_13, label: PWM_AB, identifier: PWM_AB}
- {pin_num: E5, pin_signal: GPIO_EMC_B1_14, label: PWM_BT, identifier: PWM_BT}
- {pin_num: E2, pin_signal: GPIO_EMC_B1_15, label: PWM_BB, identifier: PWM_BB}
- {pin_num: C2, pin_signal: GPIO_EMC_B1_17, label: PWM_CT, identifier: PWM_CT}
- {pin_num: G1, pin_signal: GPIO_EMC_B1_16, label: PWM_CB, identifier: PWM_CB}
- {pin_num: D2, pin_signal: GPIO_EMC_B1_11, label: LED_GREEN_CTL, identifier: LED_GREEN_CTL}
- {pin_num: G3, pin_signal: GPIO_EMC_B1_00, label: ENC_A, identifier: ENC_A}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbar.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitADC();
    BOARD_InitPWM();
    BOARD_InitLPUART();
    BOARD_InitENC();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: D2, peripheral: RGPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_B1_11, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of LED_GREEN_CTL on GPIO_EMC_B1_11 (pin D2) */
  rgpio_pin_config_t LED_GREEN_CTL_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_11 (pin D2) */
  RGPIO_PinInit(RGPIO2, 11U, &LED_GREEN_CTL_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_GPIO2_IO11,       /* GPIO_EMC_B1_11 is configured as GPIO2_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N14, peripheral: ADC1, signal: 'A, 1_2', pin_signal: GPIO_AD_12}
  - {pin_num: M13, peripheral: ADC1, signal: 'B, 1_2', pin_signal: GPIO_AD_13}
  - {pin_num: L13, peripheral: ADC2, signal: 'B, 2_5', pin_signal: GPIO_AD_29, identifier: CUR_C}
  - {pin_num: M12, peripheral: ADC1, signal: 'A, 1_1', pin_signal: GPIO_AD_14}
  - {peripheral: ADC1, signal: 'HW_TRIG, 0', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
  - {peripheral: ADC2, signal: 'HW_TRIG, 4', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_GPIO4_IO12,           /* GPIO_AD_12 is configured as GPIO4_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_GPIO4_IO13,           /* GPIO_AD_13 is configured as GPIO4_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_14_GPIO4_IO14,           /* GPIO_AD_14 is configured as GPIO4_IO14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_29_GPIO4_IO29,           /* GPIO_AD_29 is configured as GPIO4_IO29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputAdc12HwTrig0); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT140 output assigned to ADC1_2_HW_TRIG0 */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputAdc12HwTrig4); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT144 output assigned to ADC1_2_HW_TRIG4 */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: D7, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: E3, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_13}
  - {pin_num: E5, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_14}
  - {pin_num: E2, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_B1_15}
  - {pin_num: C2, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_17}
  - {pin_num: G1, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_B1_16}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXPWM4_PWMA00,  /* GPIO_EMC_B1_12 is configured as FLEXPWM4_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_FLEXPWM4_PWMB00,  /* GPIO_EMC_B1_13 is configured as FLEXPWM4_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_14_FLEXPWM4_PWMA01,  /* GPIO_EMC_B1_14 is configured as FLEXPWM4_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_15_FLEXPWM4_PWMB01,  /* GPIO_EMC_B1_15 is configured as FLEXPWM4_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_16_FLEXPWM4_PWMB02,  /* GPIO_EMC_B1_16 is configured as FLEXPWM4_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_17_FLEXPWM4_PWMA02,  /* GPIO_EMC_B1_17 is configured as FLEXPWM4_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPUART:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: A6, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPUART, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPUART(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: EQDC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_B1_00}
  - {pin_num: H4, peripheral: EQDC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_B1_01, identifier: ENC_B}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4(0x00U) /* IOMUXC XBAR_INOUT4 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5(0x00U) /* IOMUXC XBAR_INOUT5 function direction select: XBAR_INOUT as input */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_XBAR1_XBAR_INOUT04,  /* GPIO_EMC_B1_00 is configured as XBAR1_XBAR_INOUT04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_XBAR1_XBAR_INOUT05,  /* GPIO_EMC_B1_01 is configured as XBAR1_XBAR_INOUT05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout04, kXBAR1_OutputEqdc1Phasea); /* IOMUX_XBAR_INOUT04 output assigned to XBAR1_IN4 input is connected to XBAR1_OUT87 output assigned to EQDC1_PHASEA */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout05, kXBAR1_OutputEqdc1Phaseb); /* IOMUX_XBAR_INOUT05 output assigned to XBAR1_IN5 input is connected to XBAR1_OUT88 output assigned to EQDC1_PHASEB */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
